In [6]:
def equal_slices(total_slices, no_recipients, slices_each): 
    return (slices_each * no_recipients) <= total_slices

equal_slices(24, 12, 2)

True

In [34]:
def equal_slices(total_slices, no_recipients, slices_each):
    num_slices = slices_each * no_recipients
    remainder = max(0, total_slices - (slices_each * no_recipients))
    
    if no_recipients == 0:
        return True, total_slices
    
    elif ((slices_each * no_recipients) <= total_slices) == False:
        return (slices_each * no_recipients) <= total_slices, None
    
    else:
        return (slices_each * no_recipients) <= total_slices, remainder
    
    
equal_slices(11, 5, 2)

(True, 1)

In [51]:
def count_unique_chars(string_1, string_2):
    strings = string_1 + string_2
    return len(set(strings)) 
    
count_unique_chars("a", "soup")

5

In [55]:
def reverse_capitalize(string):
    return string.upper()[::-1]

reverse_capitalize("abc")

'CBA'

In [69]:
def divisible(integer):
    return True if integer % 100 == 0 else False

divisible(500)

True

In [8]:
def filter_list(lst):
    new_list = []
    for i in lst:
        if isinstance(i, int) == True:
            new_list.append(i)
    return new_list
    
filter_list([1, 2, 3, "a", "b", 4]) 
filter_list(['A', 0, 'Edabit', 1729, 'Python', '1729'])

[0, 1729]

In [14]:
def mean(digits):
    counter = 0
    total = 0
    for i in str(digits):
        counter += 1
        total += int(i)
    return total / counter
    
mean(42)

3.0

In [17]:
def count_all(string):
    Lcount = 0
    Dcount = 0
    dic = {}
    
    for i in string:
        if i.isdigit():
            Dcount+=1
        elif i.isalpha():
            Lcount+=1
            
    dic['LETTERS'] = Lcount
    dic['DIGITS'] = Dcount
    
    return dic
    
count_all("H3ll0 Wor1d")

{'LETTERS': 7, 'DIGITS': 3}

In [11]:
import pandas as pd
import numpy as np

#Create a Dictionary of series
d = {'Name':pd.Series(['Andres','James','David','Vin','Steve','David','Jack',
   'Lee','David','Gasper','Betina','Andres']),
   'Age':pd.Series([25,26,25,23,30,29,23,34,40,30,51,46]),
   'Rating':pd.Series([4.23,3.24,3.98,2.56,3.20,4.6,3.8,3.78,2.98,4.80,4.10,3.65])
}

#Create a DataFrame
df = pd.DataFrame(d)


df

      Name  Age  Rating
0   Andres   25    4.23
1    James   26    3.24
2    David   25    3.98
3      Vin   23    2.56
4    Steve   30    3.20
5    David   29    4.60
6     Jack   23    3.80
7      Lee   34    3.78
8    David   40    2.98
9   Gasper   30    4.80
10  Betina   51    4.10
11  Andres   46    3.65

In [18]:
"""
Write a function that takes df (defined above) as input and returns tuple with 3 values:
   - Most common name (string)
   - Average age (float)
   - IQR of rating (float)

Notes:
   - Average age and IQR must be float not numpy.float64 type
"""


def compute_statistics(df):
    Q3 = np.quantile(df['Rating'], 0.75)
    Q1 = np.quantile(df['Rating'], 0.25)
    IQR = Q3 - Q1
    avg = df['Age'].mean()
    comname = df['Name'].value_counts().idxmax()
    return comname, avg, float(IQR)
    
compute_statistics(df)

('David', 31.833333333333332, 0.9024999999999999)

In [34]:
data = {'animal': ['cat', 'cat', 'snake', 'dog', 'dog', 'cat', 'snake', 'cat', 'dog', 'dog'],
        'age': [2.5, 3, 0.5, np.nan, 5, 2, 4.5, np.nan, 7, 3],
        'visits': [1, 3, 2, 3, 2, 3, 1, 1, 2, 1],
        'priority': ['yes', 'yes', 'no', 'yes', 'no', 'no', 'no', 'yes', 'no', 'no']}

labels = ['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h', 'i', 'j']

df = pd.DataFrame(data, index=labels)

df

  animal  age  visits priority
a    cat  2.5       1      yes
b    cat  3.0       3      yes
c  snake  0.5       2       no
d    dog  NaN       3      yes
e    dog  5.0       2       no
f    cat  2.0       3       no
g  snake  4.5       1       no
h    cat  NaN       1      yes
i    dog  7.0       2       no
j    dog  3.0       1       no

In [50]:
"""
Write a function that takes dataframe df (defined above) and string with animal as inputs and returns rows where animal is equal to string (parameter function) and age is less than 3.

Notes:
        - Return empty DataFrame if wrong animal is written
"""

def filter_animals(df,animal):
    
    newDF = pd.DataFrame()
    
    if df['animal'].str.contains(animal).any():
        return df[df['animal'].str.contains(animal)][df['age'] < 3]
    else:
        return newDF
        
filter_animals(df,'joe')

Empty DataFrame
Columns: []
Index: []

In [23]:

"""
Write a function that takes dataframe df (defined above) as input and returns filtered dataframe with:
        - Only numeric columns
        - Only rows without any missing values

Notes:
        - Don’t select the columns and rows manually (use filtering)
"""

def filter_dataframe(df):
    return df.select_dtypes(include='number').dropna()
    
filter_dataframe(df)

   age  visits
a  2.5       1
b  3.0       3
c  0.5       2
e  5.0       2
f  2.0       3
g  4.5       1
i  7.0       2
j  3.0       1

In [135]:
def even_odd_transform(lst,repeat):
    
    new_list = []
    
    for i in lst:
        if (i % 2) == 0:
            j = i - 2*repeat
            new_list.append(j)
        else:
            j = i + 2*repeat
            new_list.append(j)
            
    print(new_list)

even_odd_transform([3, 4, 9], 3)

[9, -2, 15]

In [9]:
def load_excel(path):
    return pd.read_excel(path)

In [33]:
import pandas as pd
import sys

df = load_excel('SaleData.xlsx')


"""
Write a Pandas program to find the total sale amount (Sale_amt) region and manager wise. 
Order the dataframe by Sale_amt, starting with the highest.
Output should be DataFrame with 3 columns (order is important):
    - Region
    - Manager
    - Sale_amt
and numeric index starting with 0 (after sorting).
"""

def compute_total_sale(df):
    columns = df[['Region','Manager','Sale_amt']] 
    new_df = columns.copy()
    new_df = new_df.sort_values(by='Sale_amt', ascending=False)
    new_df = new_df.reset_index(drop=True)
    print(new_df)
    
compute_total_sale(df)

     Region  Manager   Sale_amt
0      East   Martha  113810.00
1   Central  Hermann  107820.00
2   Central  Hermann  107820.00
3   Central   Martha   89850.00
4   Central  Douglas   80266.00
5   Central   Martha   79068.00
6      West  Timothy   67088.00
7   Central  Timothy   63494.00
8       NaN      NaN   62550.00
9   Central  Hermann   47000.00
10  Central  Douglas   43500.00
11  Central  Hermann   43128.00
12     East   Martha   41930.00
13     East  Douglas   40500.00
14  Central  Timothy   40000.00
15     West  Douglas   38336.00
16     East   Martha   30000.00
17     East   Martha   30000.00
18     West  Douglas   28500.00
19  Central  Hermann   25000.00
20  Central  Timothy   23000.00
21     East   Martha   21600.00
22     West  Timothy   17100.00
23  Central   Martha   16772.00
24     East   Martha   14500.00
25     East   Martha   14400.00
26  Central   Martha   14000.00
27  Central  Hermann   14000.00
28  Central  Timothy    8386.00
29      NaN      NaN    7818.75
30  Central  Timothy    6075.00
31  Central  Hermann    5616.00
32  Central  Hermann    5500.00
33     East  Douglas    4329.00
34     East   Martha    3627.00
35     West  Timothy    3500.00
36     East  Douglas    3375.00
37  Central  Hermann    3217.50
38  Central  Hermann    2925.00
39  Central  Hermann    2457.00
40     East   Martha    2000.00
41     East   Martha     936.00
42  Central  Hermann     625.00
43     West  Timothy     375.00
44  Central  Douglas     250.00

In [92]:
"""
Write a function to count the manager wise sale (sale_cnt)
and mean value of sale amount (sale_mean). 
Order the output dataframe by sale_cnt, starting with the highest.
Output should be DataFrame with 3 columns (order is important):
    - Manager
    - sale_cnt
    - sale_mean
and numeric index starting with 0 (after sorting).
"""

def compute_agg_stats(df):
    columns = df[['Manager','Sale_amt']] 
    new_df = columns.copy()
    new_df = new_df.groupby(['Manager']).mean()
    new_df['sale_cnt'] = df['Manager'].value_counts()
    new_df = new_df.sort_values(by='sale_cnt', ascending=False)
    new_df = new_df.reset_index()
    new_df = new_df[["Manager", "sale_cnt", "Sale_amt"]]
    new_df = new_df.rename(columns={'Sale_amt': "sale_mean"})
    print(new_df)
    
compute_agg_stats(df)

   Manager  sale_cnt     sale_mean
0   Martha        14  33749.500000
1  Hermann        12  30425.708333
2  Timothy         9  25446.444444
3  Douglas         8  29882.000000

In [134]:
"""
A pie chart is a circular graphical representation of a dataset, 
where each category frequency is represented by a slice (or circular sector) 
with an amplitude in degrees given by the single frequency percentage over the total of frequencies. 

You can obtain the degrees of sectors following these steps:
    - Calculate frequencies total.
    - Calculate percentage of every category frequency dividing it by the frequencies total.
    - Transform every percentage in degrees multiplying it for 360.

You are given a dictionary data with keys being the data categories (represented by letters) and values 
being the data frequencies. Implement a function that returns a map to design a pie chart, 
like to say the same dictionary with values transformed in degrees instead of frequencies. 
Round final values to the nearest tenth.

Example:
    pie_chart({ "a": 1, "b": 2 }) ➞ { "a": 120, "b": 240 }

    pie_chart({ "a": 30, "b": 15, "c": 55 }) ➞ { "a": 108, "b": 54, "c": 198 }

    pie_chart({ "a": 8, "b": 21, "c": 12, "d": 5, "e": 4 }) ➞ { "a": 57.6, "b": 151.2, "c": 86.4, "d": 36, "e": 28.8 }
"""


def pie_chart(dictionary):
    
    count = 0
    lst = []
    i = 0
    
    for value in dictionary.values():
        count += value
    for value in dictionary.values():
        new_value = 360*(value / count)
        new_value = round(new_value, 3)
        lst.append(new_value)

    for key in dictionary.keys():
        print(key)
        dictionary[key] = lst[i]
        i+=1
    
    print(dictionary)
    
pie_chart({ "a": 8, "b": 21, "c": 12, "d": 5, "e": 4 })

a
b
c
d
e
{'a': 57.6, 'b': 151.2, 'c': 86.4, 'd': 36.0, 'e': 28.8}